data/03_sos/sensordata/S2.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sosInsertSensor.xsd     http://www.opengis.net/swes/2.0 http://schemas.opengis.net/swes/2.0/swes.xsd">
    <env:Body>
        <swes:InsertSensor
            xmlns:swes="http://www.opengis.net/swes/2.0"
            xmlns:sos="http://www.opengis.net/sos/2.0"
            xmlns:swe="http://www.opengis.net/swe/2.0"
            xmlns:sml="http://www.opengis.net/sensorml/2.0"
            xmlns:gml="http://www.opengis.net/gml/3.2"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xmlns:gco="http://www.isotc211.org/2005/gco"
            xmlns:gmd="http://www.isotc211.org/2005/gmd" service="SOS" version="2.0.0">
            <swes:procedureDescriptionFormat>http://www.opengis.net/sensorml/2.0</swes:procedureDescriptionFormat>
            <swes:procedureDescription>
                <sml:PhysicalSystem gml:id="sensor9">

                        <!--Unique identifier -->
                        <gml:identifier codeSpace="uniqueID">http://www.engicloud.net/sos/ls/procedure/tps0000_2_2_2_S2</gml:identifier>
                        <sml:identification>
                            <sml:IdentifierList>

                                <sml:identifier>
                                    <sml:Term definition="urn:ogc:def:identifier:OGC:1.0:longName">
                                        <sml:label>longName</sml:label>
                                        <sml:value>Topcon</sml:value>
                                    </sml:Term>
                                </sml:identifier>

                                <sml:identifier>
                                    <sml:Term definition="urn:ogc:def:identifier:OGC:1.0:shortName">
                                        <sml:label>shortName</sml:label>
                                        <sml:value>Topcon</sml:value>
                                    </sml:Term>
                                </sml:identifier>

                                <sml:identifier>
                                    <sml:Term definition="http://www.engicloud.net/sos/ls/projectName">
                                        <sml:label>projectName</sml:label>
                                        <sml:value>ArchCadastre</sml:value>
                                    </sml:Term>
                                </sml:identifier>

                                <sml:identifier>
                                    <sml:Term
                                        definition="http://sensorml.com/ont/swe/property/HeightAboveGround">
                                        <sml:label>height</sml:label>
                                        <sml:value>1.725</sml:value>
                                    </sml:Term>
                                </sml:identifier>

                                <sml:identifier>
                                    <sml:Term definition="http://www.engicloud.net/sos/ls/observableProperty/stationId">
                                        <sml:label>stationId</sml:label>
                                        <sml:value>S2</sml:value>
                                    </sml:Term>
                                </sml:identifier>

                            </sml:IdentifierList>
                        </sml:identification>


                        <sml:capabilities name="offerings">
                            <sml:CapabilityList>
                                <sml:capability name="offeringID">
                                    <swe:Text definition="urn:ogc:def:identifier:OGC:offeringID">
                                        <swe:label>offeringID</swe:label>
                                        <swe:value>http://www.engicloud.net/sos/ls/procedure/tps0000_2_2_2_S2</swe:value>
                                    </swe:Text>
                                </sml:capability>
                            </sml:CapabilityList>
                        </sml:capabilities>


                        <sml:contacts>
                            <sml:ContactList>
                                <sml:contact>
                                    <gmd:CI_ResponsibleParty>
                                        <gmd:individualName>
                                            <gco:CharacterString>Χρήστος Γκαρσιούδης</gco:CharacterString>
                                        </gmd:individualName>
                                        <gmd:organisationName>
                                            <gco:CharacterString>NA</gco:CharacterString>
                                        </gmd:organisationName>
                                        <gmd:contactInfo>
                                            <gmd:CI_Contact>
                                                <gmd:address>
                                                    <gmd:CI_Address>
                                                        <gmd:electronicMailAddress>
                                                            <gco:CharacterString>xgarsiu2@gmail.com</gco:CharacterString>
                                                        </gmd:electronicMailAddress>
                                                    </gmd:CI_Address>
                                                </gmd:address>
                                                <gmd:onlineResource xlink:href="http://www.sofos.me"/>
                                            </gmd:CI_Contact>
                                        </gmd:contactInfo>
                                        <gmd:role>
                                            <gmd:CI_RoleCode codeList="http://www.isotc211.org/2005/resources/Codelist/gmxCodelists.xml#CI_RoleCode/" codeListValue="CI_RoleCode_pointOfContact">Point of Contact</gmd:CI_RoleCode>
                                        </gmd:role>
                                    </gmd:CI_ResponsibleParty>
                                </sml:contact>
                            </sml:ContactList>
                        </sml:contacts>




                        <sml:outputs>
                            <sml:OutputList>
                                <sml:output name="shv">
                                    <swe:DataArray>
                                        <swe:elementCount>
                                            <swe:Count/>
                                        </swe:elementCount>
                                        <swe:elementType name="Components">
                                            <swe:DataRecord xmlns:ns="http://www.opengis.net/swe/2.0">
                                                <ns:field name="targetId">
                                                    <swe:Text definition="http://sensorml.com/ont/swe/property/ObjectOfInterestIdentifier"/>
                                                </ns:field>
                                                <ns:field name="slopeDistance">
                                                    <swe:Quantity definition="http://sensorml.com/ont/swe/property/CollectorToObjectOfInterestDistance">
                                                        <ns:uom code="m"/>
                                                    </swe:Quantity>
                                                </ns:field>
                                                <ns:field name="horizontalDirection">
                                                    <swe:Quantity definition="http://sensorml.com/ont/swe/property/Azimuth">
                                                        <ns:uom code="degree"/>
                                                    </swe:Quantity>
                                                </ns:field>
                                                <ns:field name="verticalAngle">
                                                    <swe:Quantity definition="http://sensorml.com/ont/swe/property/AlphaAngle">
                                                        <ns:uom code="degree"/>
                                                    </swe:Quantity>
                                                </ns:field>
                                                <ns:field name="targetHeight">
                                                    <swe:Quantity definition="http://sensorml.com/ont/swe/property/HeightAboveGround">
                                                        <ns:uom code="m"/>
                                                    </swe:Quantity>
                                                </ns:field>
                                                <ns:field name="targetType">
                                                    <swe:Text definition="http://www.engicloud.net/sos/ls/observableProperty/targetType"/>
                                                </ns:field>
                                            </swe:DataRecord>
                                        </swe:elementType>
                                    </swe:DataArray>
                                </sml:output>
                            </sml:OutputList>
                        </sml:outputs>


                        <sml:position>
                            <swe:Vector referenceFrame="urn:ogc:def:crs:EPSG::4326">
                                <swe:coordinate name="easting">
                                    <swe:Quantity axisID="x">
                                        <swe:uom code="degree"/>
                                        <swe:value>23.720755510976</swe:value>
                                    </swe:Quantity>
                                </swe:coordinate>
                                <swe:coordinate name="northing">
                                    <swe:Quantity axisID="y">
                                        <swe:uom code="degree"/>
                                        <swe:value>37.977393883902</swe:value>
                                    </swe:Quantity>
                                </swe:coordinate>
                                <swe:coordinate name="altitude">
                                    <swe:Quantity axisID="z">
                                        <swe:uom code="m"/>
                                        <swe:value>0</swe:value>
                                    </swe:Quantity>
                                </swe:coordinate>
                            </swe:Vector>
                        </sml:position>


                    </sml:PhysicalSystem>
                </swes:procedureDescription>
                <!-- multiple values possible -->
                <swes:observableProperty>http://sensorml.com/ont/swe/property/Azimuth</swes:observableProperty>
                <swes:observableProperty>http://sensorml.com/ont/swe/property/AlphaAngle</swes:observableProperty>
                <swes:observableProperty>http://sensorml.com/ont/swe/property/CollectorToObjectOfInterestDistance</swes:observableProperty>
                <swes:observableProperty>http://sensorml.com/ont/swe/property/HeightAboveGround</swes:observableProperty>
                <swes:observableProperty>http://sensorml.com/ont/swe/property/ObjectOfInterestIdentifier</swes:observableProperty>
                <swes:observableProperty>http://www.engicloud.net/sos/ls/observableProperty/targetType</swes:observableProperty>

                <swes:metadata>
                    <sos:SosInsertionMetadata>
                        <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement</sos:observationType>
                        <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement</sos:observationType>
                        <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement</sos:observationType>
                        <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement</sos:observationType>
                        <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_TextObservation</sos:observationType>
                        <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_TextObservation</sos:observationType>
                    </sos:SosInsertionMetadata>
                </swes:metadata>
            </swes:InsertSensor>
        </env:Body>
    </env:Envelope>